lab11_php_ci/ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
    public function admin_index()
    {
         $title = 'Daftar Artikel';
         $q = $this->request->getVar('q') ?? '';
         $model = new ArtikelModel();
         $data = [
         'title' => $title,
         'q' => $q,
         'artikel' => $model->like('judul', $q)->paginate(3), # data dibatasi 3 record per halaman

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`) VALUES ('Artikel Kelima', 'Hi.. Hello, salam kenal ya...\r\n\r\nSaya Diyan Arum Maheswari. Salah satu mahasiswi Universitas Pelita Bangsa dari Fakultas Teknik di Jurusan Teknik Informatika.\r\n\r\n', 'Artikel-Kelima', 'Remini20220404130821208.jpg')
---
    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid)
        {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'gambar' => $file->getName(),
            ]);